In [1]:
import pandas as pd

In [19]:
dataset_url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
baby_names = pd.read_csv(dataset_url)

In [11]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [20]:
del baby_names['Unnamed: 0']
del baby_names['Id']

In [21]:
baby_names["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [64]:
names = baby_names.groupby('Name')

In [24]:
len(names)

17632

In [39]:
names["Count"].sum().sort_values(ascending=False).reset_index().head(1)

    Name   Count
0  Jacob  242874

In [71]:
names["Count"].sum().sort_values(ascending=True).value_counts()
# filt = names["Count"].sum() == names["Count"].sum().min()
# names["Count"].sum()[filt]

5         2578
6          751
10         700
11         474
12         279
          ...
2776         1
2770         1
2768         1
2763         1
242874       1
Name: Count, Length: 3279, dtype: int64

In [59]:
names["Count"].sum().median()

49.0

In [60]:
names["Count"].sum().std()

11006.06946789057

In [74]:
names["Count"].describe()

         count       mean        std  min   25%   50%    75%    max
Name
Aaban      2.0   6.000000   0.000000  6.0  6.00   6.0   6.00    6.0
Aadan      4.0   5.750000   0.957427  5.0  5.00   5.5   6.25    7.0
Aadarsh    1.0   5.000000        NaN  5.0  5.00   5.0   5.00    5.0
Aaden    196.0  17.479592  21.154974  5.0  6.00  10.0  20.00  158.0
Aadhav     1.0   6.000000        NaN  6.0  6.00   6.0   6.00    6.0
...        ...        ...        ...  ...   ...   ...    ...    ...
Zyra       7.0   6.000000   1.154701  5.0  5.00   6.0   6.50    8.0
Zyrah      2.0   5.500000   0.707107  5.0  5.25   5.5   5.75    6.0
Zyren      1.0   6.000000        NaN  6.0  6.00   6.0   6.00    6.0
Zyria     10.0   5.900000   0.737865  5.0  5.25   6.0   6.00    7.0
Zyriah     9.0   6.444444   1.666667  5.0  5.00   6.0   7.00   10.0

[17632 rows x 8 columns]